reading-notes/data-engineering/bioinformatics-with-pachyderm.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2020-05-21 Thu 14:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="css/python_course.css">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Introduction</h2>
<div class="outline-text-2" id="text-">
<p>
Computational bioinformatics use complex pipelines that need to be orchestrated on modern
infrastructure, and reproducible.
Needs to
</p>
<ul class="org-ul">
<li>Run tools reliably in any computational environment
</li>
<li>A well-defined way to orchestrate this
</li>
<li>Data management layer for reproducibility
</li>
</ul>
<p>
Pachyderm fullfils these requirements, the thesis contains multiple contributions
to pachyderm as well as an example that shows the properties of pachyderm.
</p>

<p>
Bioinformatics turned more complex and data-intensive in the recent years.
Foundation of the scientific method is that experiments are reproducible by
other researchers.
</p>

<p>
Usage of various processing environments and franeworks make this hard.
Snakemake, galaxy aid researchers by managing dependencies between tools under the hood.
VMs have fallen out of favor since availability and reproducibility are poor.
Microservices architecture inspired use of Docker containers for pipelines.
They are lightweight, scalabe and capture the compute env. reliably.
</p>

<p>
<b>Pachyderm</b>. built on kubernetes, promises scalability, as well as reproducibility
through use of containers and a fully versioned filesystem.
</p>

<p>
Many pipeline solutions exist
</p>
<ul class="org-ul">
<li>Bpipe, Reflow are tied to specific language, no containers
</li>
<li>Dat, Git LFS handle data dependencies, not integrated with any pipelining things
</li>
<li>iRODS can be used to implement file access layer and pipelining solution through a 
</li>
</ul>
<p>
rule-based language
</p>

<p>
Pachyderm along with Argo is one of the few workflow tools,
that are language/data agnostic.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">System and methods</h2>
<div class="outline-text-2" id="text-">
<p>
Pachyderm leverages open source software of the container ecosystem (docker, k8s, etcd)
The pachyderm daemon (pachd) consists of 
</p>
<ul class="org-ul">
<li>block store component
</li>
<li>filesystem component cooperates with block store to handle pfs (pachyderm file system) requests
</li>
<li>pipelining component controls the worker pods via k8s API, coordinates the injection of data with file system component
</li>
<li>A separate object store is used to save data
</li>
<li>ETCD key value store is used for managing pipeline state and such
</li>
<li>Pachyderm has an internal caching system
</li>
</ul>

<p>
External storage does not have to be used
But you can use e.g. external GlusterFS and minion processes to pull/upload files between k8s and glusterfs
</p>

<p>
PFS
</p>

<ul class="org-ul">
<li>Copy on write semantics, every dataset used needs to be possible to restore
</li>
<li>Files are hashed, and stored in the filesystem using this hash (similar to DVC)
</li>
<li>Hash is tracked in etcd
</li>
<li>Versions of files live in a pachyderm data repository (pdr)
</li>
</ul>

<p>
Using this concept of data repositories and pipelines data provenance/lineage can be automatically tracked.
Any state of data is identified by a commit, and it is also possible to get versioned pipeline definitions used to process a datum.
"any run of any pipeline producing any result is completely reproducible and explainable"
</p>

<p>
Pachyderm workers
</p>

<p>
Are long-running pods (by default) that run pachyderm system containers along with the user container.
They are created alongside the pipeline definition.
</p>

<p>
Incremental processing, only new data is fed to jobs as soon as it's commited to a repository
</p>

<p>
Data is split into <i>datums</i>, minimum independently processable units (e.g. lines in a csv file) for parallel processing.
Number of workers is controlled by the user, and a worker processes one datum at the time in isolation.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Results</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>Authors contributed block storage (S3?) integrations with pachyderm
</li>
<li>And a helm chart to deploy in multiple infrastructure scenarios
</li>
</ul>

<p>
Pachyderm was used to implement a really complex bioinformatics pipeline.
Scaling efficiency and speedup with regards to reference solution were measured.
</p>
</div>
</div>


<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Discussion</h2>
<div class="outline-text-2" id="text-">
<p>
Containers are more and more used for distributed and reproducible processing,
high adoption in bioinformatics
Performance impact of using containers (as opposed to say .jar applications) is negligible.
<i>"a scaling efficiency of 79% and a speedup of 63 were achieved when using 80 workers in one of the benchmarks."</i>
</p>

<p>
Drawbacks of pachyderm
</p>

<ul class="org-ul">
<li>limited access to external storage and data locality
</li>
<li>non-optimal container networking and security
</li>
<li>performance overhead when compared to bare-metal settings
</li>
<li>It's possible to implement streaming pipelines, but job parallelism is not possible
</li>
<li>100% tied to k8s, and Kubernetes is not easy to set up
</li>
</ul>

<p>
Overall pachyderm is a good and convenient tool if one can live with above drawbacks.
</p>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">Introduction</a></li>
<li><a href="#sec-">System and methods</a></li>
<li><a href="#sec-">Results</a></li>
<li><a href="#sec-">Discussion</a></li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
